In [3]:
%load_ext sql
%sql sqlite:///PS1.db

Problem Set 1 [75 points]
=======

### Deliverables:

Submit your queries (and only those) using the `submission_template.txt` file that is posted on the class website. Follow the instructions on the file! Upload the file at Canvas (under PS1).


### Instructions / Notes:

* Run the top cell above to load the database `PS1.db` (make sure the database file, `PS1.db`, is in the same directory as this IPython notebook is running in)
* Some of the problems involve _changing_ this database (e.g. deleting rows)- you can always re-download `PS1.db` or make a copy if you want to start fresh!
* You **may** create new IPython notebook cells to use for e.g. testing, debugging, exploring, etc.- this is encouraged in fact!- **just make sure that your final answer for each question is _in its own cell_ and _clearly indicated_**
* When you see `In [*]:` to the left of the cell you are executing, this means that the code / query is _running_.
    * **If the cell is hanging- i.e. running for too long: To restart the SQL connection, you must restart the entire python kernel**
    * To restart kernel using the menu bar: "Kernel >> Restart >> Clear all outputs & restart"), then re-execute the sql connection cell at top
    * You will also need to restart the connection if you want to load a different version of the database file
* Remember:
    * `%sql [SQL]` is for _single line_ SQL queries
    * `%%sql [SQL]` is for _multi line_ SQL queries
* _Have fun!_

Problem 1: Linear Algebra [25 points]
------------------------

Two random 3x3 ($N=3$) matrices have been provided in tables `A` and `B`, having the following schema:
> * `i INT`:   Row index
> * `j INT`:   Column index
> * `val INT`: Cell value

**Note: all of your answers below _must_ work for any _square_ matrix sizes, i.e. any value of $N$**.

Note how the matrices are represented - why do we choose this format?  Run the following queries to see the matrices in a nice format:

In [4]:
%sql SELECT group_concat(val, " , ") AS "A" FROM A GROUP BY i;

 * sqlite:///PS1.db
Done.

[('7 , 5 , 8',), ('10 , 7 , 7',), ('2 , 0 , 5',)]

In [5]:
%sql SELECT group_concat(val, " , ") AS "B" FROM B GROUP BY i;

 * sqlite:///PS1.db
Done.

[('9 , 6 , 10',), ('7 , 6 , 9',), ('1 , 1 , 7',)]

### Part (a): Matrix addition [5 points]

The sum of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $n\times m$) is the matrix $C$ (of dimension $n\times m$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = A_{ij} + B_{ij}$

Write a single SQL query to get the sum of $A$ and $B$ (in the same format as $A$ and $B$):

In [106]:
%sql SELECT A.i, A.j, (A.val + B.val) AS val FROM A,B WHERE (A.i = B.i) AND (A.j = B.j) ORDER BY A.i, A.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 16),
 (0, 1, 11),
 (0, 2, 18),
 (1, 0, 17),
 (1, 1, 13),
 (1, 2, 16),
 (2, 0, 3),
 (2, 1, 1),
 (2, 2, 12)]

### Part (b): Dot product [5 points]

The _dot product_ of two vectors

$a = \begin{bmatrix}a_1 & a_2 & \dots & a_n\end{bmatrix}$

and

$b = \begin{bmatrix}b_1 & b_2 & \dots & b_n\end{bmatrix}$

is

$a\cdot b = \sum_{i=1}^n a_ib_i = a_1b_1 + a_2b_2 + \dots + a_nb_n$

Write a _single SQL query_ to take the dot product of the **third column of $A$** and the **second column of $B$.**:

In [70]:
%sql SELECT SUM(A.val * B.val) AS DotProduct FROM A, B WHERE (A.j = 2) AND (B.j = 1) AND (A.i = B.i);

 * sqlite:///PS1.db
Done.

[(95,)]

### Part (c): Matrix multiplication [5 points]

The product of a matrix $A$ (having dimensions $n\times m$) and a matrix $B$ (having dimensions $m\times p$) is the matrix $C$ (of dimension $n\times p$) having cell at row $i$ and column $j$ equal to:

$C_{ij} = \sum_{k=1}^m A_{ik}B_{kj}$

In other words, to multiply two matrices, get each cell of the resulting matrix $C$, $C_{ij}$, by taking the _dot product_ of the $i$th row of $A$ and the $j$th column of $B$.

Write a single SQL query to get the matrix product of $A$ and $B$ (in the same format as $A$ and $B$):

In [114]:
%sql SELECT A.i, B.j, SUM(A.val * B.val) AS val FROM A, B WHERE (A.j = B.i) GROUP BY A.i, B.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 106),
 (0, 1, 80),
 (0, 2, 171),
 (1, 0, 146),
 (1, 1, 109),
 (1, 2, 212),
 (2, 0, 23),
 (2, 1, 17),
 (2, 2, 55)]

### Part (d): Matrix power [10 points]

The power $A^n$ of a matrix $A$ is defined as the matrix product of $n$ copies of $A$. 

Write a _single SQL query_ that computes the **fourth power** of matrix $A$, in other words, $A^4 = A \cdot A \cdot A \cdot A$:

In [147]:
%%sql
WITH a3 AS 
    (SELECT a1.i, a2.j, SUM(a1.val * a2.val) AS val 
    FROM A a1, A a2
    WHERE (a1.j = a2.i) 
    GROUP BY a1.i, a2.j)
SELECT a4.i, a5.j, SUM(a4.val * a5.val) AS val
FROM a3 a4, a3 a5
WHERE (a4.j = a5.i)
GROUP BY a4.i, a5.j;

 * sqlite:///PS1.db
Done.

[(0, 0, 1767),
 (0, 1, 1065),
 (0, 2, 2065),
 (1, 0, 2396),
 (1, 1, 1463),
 (1, 2, 2745),
 (2, 0, 350),
 (2, 1, 190),
 (2, 2, 467)]

Problem 2: The Sales Database [25 points]
----------------------------------------------

We've prepared and loaded a dataset related to sales data from a company. The dataset has the following schema:

> `Holidays (WeekDate, IsHoliday)`

> `Stores (Store, Type, Size)`

> `TemporalData(Store, WeekDate, Temperature, FuelPrice, CPI, UnemploymentRate)`

> `Sales (Store, Dept, WeekDate, WeeklySales)`

Before you start writing queries on the database, find the schema and the constraints (keys, foreign keys).

### Part (a): Sales during Holidays [10 points]

Using a _single SQL query_, find the store(s) with the largest overall sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(Store, AllSales)`.

Write your query here:

In [ ]:
WITH weeks AS 
    (SELECT Holidays.WeekDate 
    FROM Holidays 
    WHERE (IsHoliday = 'TRUE')) 
SELECT Sales.Store, SUM(Sales.WeeklySales) AS AllSales 
FROM Sales 
WHERE Sales.WeekDate IN weeks 
GROUP BY Sales.Store 
ORDER BY AllSales DESC 
LIMIT 1;

### Part (b): When Holidays do not help Sales [10 points]

Using a _single SQL query_, compute the **number** of non-holiday weeks that had larger sales than the overall average sales during holiday weeks. Further requirements:
* Use the `WITH` clause before the main body of the query to compute a subquery if necessary.
* Return a relation with schema `(NumNonHolidays)`.

Write your query here:

In [ ]:
WITH holWeeks AS 
    (SELECT Holidays.WeekDate 
    FROM Holidays
    WHERE (IsHoliday = 'TRUE')),
holSales(Week, SalesSum) AS 
    (SELECT Sales.WeekDate, SUM(Sales.WeeklySales)
    FROM Sales
    WHERE (Sales.WeekDate IN holWeeks)
    GROUP BY Sales.WeekDate),
holAvg(avrg) AS
    (SELECT AVG(holSales.SalesSum)
    FROM holSales),
totalSales(Week, SalesSum) AS
    (SELECT Sales.WeekDate, SUM(Sales.WeeklySales)
    FROM Sales
    WHERE Sales.WeekDate NOT IN holWeeks
    GROUP BY Sales.WeekDate)
SELECT COUNT(totalSales.Week) AS NumNonHolidays
FROM totalSales, holAvg
WHERE (totalSales.SalesSum > holAvg.avrg);

### Part (c): Total Summer Sales [5 points]

Using a _single SQL query_, compute the total sales during summer (months 6,7,and 8) for each type of store. Further requirements:
* Return a relation with schema `(type, TotalSales)`.

*Hint:* SQLite3 does not support native operations on the DATE datatype. To create a workaround, you can use the `LIKE` predicate and the string concatenation operator (||). You can also use the substring operator that SQLite3 supports (`substr`).

Write your query here:

In [ ]:
SELECT Stores.Type, SUM(Sales.WeeklySales) AS TotalSales
FROM Stores 
INNER JOIN Sales ON (Stores.Store = Sales.Store)
WHERE (Sales.WeekDate LIKE "%-06-%") OR (Sales.WeekDate LIKE "%-07-%") OR (Sales.WeekDate LIKE "%-08-%")
GROUP BY Stores.Type;

Problem 3: The Traveling SQL Server Salesman Problem [25 points]
--------------------------------------------------

SQL Server salespeople are lucky as far as traveling salespeople go- they only have to sell one or two big enterprise contracts, at one or two offices in Wisconsin, in order to make their monthly quota!

Answer the following questions using the table of streets connecting company office buildings.

**Note that for convenience all streets are included _twice_, as $A \rightarrow B$ and $B \rightarrow A$.  This should make some parts of the problem easier, but remember to take it into account!**

In [ ]:
%sql SELECT * FROM streets LIMIT 4;

### Part (a): One-hop, two-hop, three-hop... [10 points]

Our salesperson has stopped at UW-Madison, to steal some cool new RDBMS technology from CS564-ers, and now wants to go sell it to a company _within 9 miles of UW-Madison and _passing through no more than 3 distinct streets_.  Write a single query, not using `WITH` (see later on), to find all such companies.

Your query should return the schema `(company, distance)` where distance is cumulative from UW-Madison.

Write your query here:

In [ ]:
SELECT dest3.B AS company, (dest1.D + dest2.D + dest3.D) AS distance
FROM Streets dest1, Streets dest2, Streets dest3
WHERE dest1.B = dest2.A AND dest2.B = dest3.A
AND (dest1.A LIKE '%UW-Madison%')
AND ((dest1.D + dest2.D + dest3.D) < 10) 
AND dest1.Direction = 'F' AND dest2.Direction = 'F' AND dest3.Direction = 'F'
UNION
SELECT dest2.B AS company, (dest1.D + dest2.D) AS distance
FROM Streets dest1, Streets dest2
WHERE dest1.B = dest2.A
AND (dest1.A LIKE '%UW-Madison%')
AND ((dest1.d + dest2.d) < 10) 
AND dest1.direction = 'F' AND dest2.direction = 'F'
UNION
SELECT dest1.B AS company, dest1.D AS distance
FROM Streets dest1
WHERE (dest1.A LIKE '%UW-Madison%')
AND (dest1.d < 10) 
AND dest1.direction = 'F';

### Part (b): A stop at the Farm [10 points]

Now, our salesperson is out in the field, and wants to see all routes- and their distances- which will take him/her from a company $A$ to a company $B$, with the following constraints:
* The route must pass through UW-Madison (in order to pick up new RDBMS tech to sell!)
* $A$ and $B$ must _each individually_ be within 2 hops of UW-Madison
* $A$ and $B$ must be different companies
* _The total distance must be $<= 15$_
* Do not use `WITH`
* If you return a path $A \rightarrow B$, _do not include_ $B \rightarrow A$ in your answer!

In order to make your answer a bit cleaner, you may split into two queries, one of which creates a `VIEW`.  A view is a virtual table based on the output set of a SQL query.  A view can be used just like a normal table- the only difference under the hood is that the DBMS re-evaluates the query used to generate it each time a view is queried by a user (thus the data is always up-to date!)

Here's a simple example of a view:

In [ ]:
%%sql 
DROP VIEW IF EXISTS short_streets;
CREATE VIEW short_streets AS 
SELECT A, B, d FROM streets WHERE d < 3;
SELECT * FROM short_streets LIMIT 3;

Write your query or queries here:

In [ ]:

DROP VIEW IF EXISTS rev;
CREATE VIEW rev AS
SELECT s1.A, s2.B, (s1.d + s2.d) AS distance 
FROM Streets s1, Streets s2
WHERE s1.B = s2.A AND s2.B = 'UW-Madison' AND s1.direction = 'R' AND s2.direction = 'R'
UNION
SELECT s1.A, s1.B, s1.d AS distance
FROM Streets s1
WHERE s1.B = 'UW-Madison' AND s1.direction = 'R';

DROP VIEW IF EXISTS fwd;
CREATE VIEW fwd AS
SELECT s1.A, s2.B, (s1.d + s2.d) AS distance
FROM Streets s1, Streets s2
WHERE s1.B = s2.A AND s1.A = 'UW-Madison' AND s1.direction = 'F' AND s2.direction = 'F'
UNION
SELECT s1.A, s1.B, s1.d AS distance
FROM Streets s1
WHERE s1.A = 'UW-Madison' AND s1.direction = 'F';

SELECT rev.A AS company_1, fwd.B AS company_2, (rev.distance + fwd.distance) AS distance
FROM rev, fwd
WHERE rev.B = fwd.A AND rev.A != fwd.B AND (rev.distance + fwd.distance) < 16;

### Part (c): Finding Triangles [5 points]

Finally, our salesperson wants to find a route that goes from company $A$ to company $B$ to company $C$ and then back to company $A$ with the following constraints:
* $A$, $B$, $C$ must be different companies
* Do not use `WITH` 
* Output each such route that you find once (use the id's as a way to break ties)
* Output the distance of the route

Write your query here:

In [ ]:
SELECT s1.A, s1.B, s2.B AS C, (s1.d + s2.d + s3.d) AS distance
FROM Streets s1, Streets s2, Streets s3
WHERE s1.B = s2.A AND s2.B = s3.A AND s3.B = s1.A
AND s1.direction = 'F' AND s2.direction = 'F' AND s3.direction = 'F'
AND s1.id < s2.id AND s2.id < s3.id;